import React from "react";

const Blogs = () => {
  return (
    <div>
      <h1>What is Context Api?</h1>
      <h4>
        Answe : রিঅ্যাক্ট কনটেক্সট এপিআই হল একটি রিঅ্যাক্ট অ্যাপের জন্য
        কার্যকরভাবে গ্লোবাল ভেরিয়েবল তৈরি করার একটি উপায় যা চারপাশে পাস করা
        যেতে পারে। এটি "প্রপ ড্রিলিং" বা দাদা-দাদি থেকে শিশু থেকে পিতা-মাতার
        কাছে প্রপস সরানোর বিকল্প। রেডক্স ব্যবহার করে রাজ্য পরিচালনার জন্য
        প্রসঙ্গটিকে একটি সহজ, হালকা পদ্ধতি হিসাবেও উল্লেখ করা হয়।
      </h4>
      <h1>What is Semantic tag?</h1>
      <h4>
        Answer : Semantic tag এইচটিএমএল উপাদানগুলি হল যেগুলি মানুষের এবং
        মেশিন-পাঠযোগ্য উপায়ে তাদের অর্থ স্পষ্টভাবে বর্ণনা করে। header, footer
        এবং article-এর মতো উপাদানগুলিকে সবকটি শব্দার্থিক বলে মনে করা হয় কারণ
        তারা উপাদানটির উদ্দেশ্য এবং তাদের ভিতরে থাকা বিষয়বস্তুর ধরণকে সঠিকভাবে
        বর্ণনা করে।
      </h4>
    </div>
  );
};

export default Blogs;
